
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДИ_ДенежныеСредстваПортфелей.Записывать = Истина;
	
	Если ВидОперации = Перечисления.ДИ_ВидОперацииДС.Ввод Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	Запись = Движения.ДИ_ДенежныеСредстваПортфелей.Добавить();
	Запись.ВидДвижения = ВидДвижения;
	Запись.Период = ДатаОперации;
	Запись.Портфель = Портфель;
	Запись.Валюта = Валюта;
	Запись.Сумма = Сумма;
	
КонецПроцедуры


// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
