
#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьТаблицуВоВременную(Таблица, ИмяВременнойТаблицы, МенеджерВТ) Экспорт

    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
    
    // Ключевой момент: текст запроса пустой, а таблица значений 
    // передаётся как параметр с типом "ТаблицаЗначений"
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    *
    |ПОМЕСТИТЬ " + ИмяВременнойТаблицы + "
    |ИЗ
    |    &Таблица КАК Таблица";
    
    Запрос.УстановитьПараметр("Таблица", Таблица);
    Запрос.Выполнить();
    
КонецПроцедуры

Процедура ЗаписатьДвиженияСКонтролемОстатков(ОписаниеРегистровДляКонтроля, Движения, Отказ) Экспорт

    Для каждого ОписаниеТаблицы Из ОписаниеРегистровДляКонтроля Цикл
    	
    	Набор = Движения[ОписаниеТаблицы.ИмяРегистра];
    	
	 	МенеджерВт = новый МенеджерВременныхТаблиц;	
		ДИ_ОбщегоНазначения.ЗагрузитьТаблицуВоВременную(Набор, "ВтДвижения", МенеджерВт);
		
		Набор.Записать();
		Набор.ПроверкаОтрицательныхОстатков(МенеджерВт, Отказ);

		МенеджерВт.Закрыть();
		
    КонецЦикла;

КонецПроцедуры	


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
