
#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьТаблицуВоВременную(Таблица, ИмяВременнойТаблицы, МенеджерВТ) Экспорт

    Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
    
    // Ключевой момент: текст запроса пустой, а таблица значений 
    // передаётся как параметр с типом "ТаблицаЗначений"
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    *
    |ПОМЕСТИТЬ " + ИмяВременнойТаблицы + "
    |ИЗ
    |    &Таблица КАК Таблица";
    
    Запрос.УстановитьПараметр("Таблица", Таблица);
    Запрос.Выполнить();
    
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
