
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВт = новый МенеджерВременныхТаблиц;
	
	ДИ_ОбщегоНАзначения.ЗагрузитьТаблицуВоВременную(МенеджерВт, ЭтотОбъект, "Движения");
	ДополнительныеСвойства.Вставить("МенеджерВт", МенеджерВт);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;

	ПроверкаОтрицательныхОстатков(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаОтрицательныхОстатков(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВт;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портфель КАК Портфель,
	|	Валюта КАК Валюта
	|ПОМЕСТИТЬ ВтРасходы
	|ИЗ
	|	ВтДвижения КАК Движения
	|ГДЕ
	|	ВидДвижения = &ВидДвижения
	|СГРУППИРОВАТЬ ПО
	|	Портфель,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтРасходы.Портфель КАК Портфель,
	|	ВтРасходы.Валюта КАК Валюта,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК Остаток
	|ИЗ
	|	ВтРасходы КАК ВтРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДИ_ДенежныеСредстваПортфелей.Остатки(, Портфель В
	|			(ВЫБРАТЬ
	|				Портфель
	|			ИЗ
	|				ВтРасходы КАК ВтРасходы)
	|		И Валюта В
	|			(ВЫБРАТЬ
	|				Валюта
	|			ИЗ
	|				ВтРасходы КАК ВтРасходы)) КАК Остатки
	|		ПО ВтРасходы.Портфель = Остатки.Портфель
	|		И ВтРасходы.Валюта = Остатки.Валюта
	|ГДЕ
	|	ЕСТЬNULL(СуммаОстаток, 0) < 0";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	РезультатРасход = Запрос.Выполнить();
	
	Если РезультатРасход.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаОстатки = РезультатРасход.Выбрать();
	
	Пока ВыборкаОстатки.Следующий() Цикл
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недостаточно денежных средств в портфеле ""%1"" в валюте ""%2"".'"),
			ВыборкаОстатки.Портфель,
			ВыборкаОстатки.Валюта);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
