
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидСделкиПриИзменении(Элемент)
	ВидСделкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПортфельПриИзменении(Элемент)
	ПортфельПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаСделкиПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура СпискомПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры

&НаКлиенте
Процедура Списком1ПриИзменении(Элемент)
	УстановитьВидимостьДоступность()
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидСделкиПриИзмененииНаСервере()
	СформироватьЗаголовок();
КонецПроцедуры


&НаСервере
Процедура ПортфельПриИзмененииНаСервере()
	СформироватьЗаголовок();
КонецПроцедуры


&НаСервере
Процедура СформироватьЗаголовок()
	
	Заголовок = СтрШаблон("%1: %2 [%3] №%4 от %5",
	 ?(ЗначениеЗАполнено(Объект.Ссылка), ?(Модифицированность, "Редактирование сделки", "Просмотр сделки"), "Добавление сделки"),
	  Объект.ВидСделки,
	  Объект.Портфель,
	  Объект.Номер,
	  Формат(Объект.ДатаСделки, "ДЛФ=Д"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.КурсВалюты.Видимость = (Объект.ВалютаСделки <> Объект.Портфель.ВалютаСделки);
	Элементы.Активы.Видимость = Списком;
	Элементы.ОдинАктив.Видимость = НЕ Списком;
КонецПроцедуры

#КонецОбласти

